In [454]:
import pandas as pd
import numpy as np

In [455]:
population = pd. Series ([9904312,3448737,2890451,2466052], index = ['서울','부산','인천','대구']) #series만들때 바로 부여하는 방법

In [456]:
population.index = ['서울','부산','인천','대전']  #{} -> 딕셔너리

In [457]:
population

서울    9904312
부산    3448737
인천    2890451
대전    2466052
dtype: int64

In [458]:
population = pd. Series({'서울': 9904312, '부산' : 3448734, '인천': 2890451, '대구': 2466052}) #시리즈 인덱스 지정하여 생성
population

서울    9904312
부산    3448734
인천    2890451
대구    2466052
dtype: int64

In [459]:
print(population.values)
print(population.index)
print(population.dtype)

[9904312 3448734 2890451 2466052]
Index(['서울', '부산', '인천', '대구'], dtype='object')
int64

In [460]:
population.name ='인구'
population.index.name = '도시'

In [461]:
population

도시
서울    9904312
부산    3448734
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [462]:
population['부산'] = 3500000       #갱신
population['대전'] = 240000        #추가

In [463]:
population

도시
서울    9904312
부산    3500000
인천    2890451
대구    2466052
대전     240000
Name: 인구, dtype: int64

In [464]:
population.drop('서울')

도시
부산    3500000
인천    2890451
대구    2466052
대전     240000
Name: 인구, dtype: int64

In [465]:
###연습문제

In [466]:
population = pd.Series({'서울':9741383, '부산': 3416918, '인천':2925967, '대구': 2453041, '대전': 1525849, '광주': 1495172, '울산': 1147037})

In [467]:
population. name = '인구'
population.index.name = '도시'

In [468]:
population

도시
서울    9741383
부산    3416918
인천    2925967
대구    2453041
대전    1525849
광주    1495172
울산    1147037
Name: 인구, dtype: int64

### 데이터 프레임 생성

In [469]:
data = {'2015':[9904312, 3448737, 2890451, 2466052],'2010': [9631482, 3393191, 2632035, 2431774]}
df = pd. DataFrame(data)

In [470]:
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [471]:
df.index = ['서울', '부산','인천','대구']

In [472]:
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

### dataframe 인덱스 지정하여 생성

In [473]:
data = [[9904312, 3448737, 2890451, 2466052], [9631482, 3393191, 2632035, 2431774]]
ind = ['2015','2010']
col = ['서울', '부산', '인천', '대구']
df2 = pd.DataFrame(data, index = ind, columns = col)

In [474]:
population=df2.T    # 행과 열 바꾸는 코드 -> .T

In [475]:
data = [[9904312,9631482],
        [3448737, 3393191],
        [2890451,2632035],
        [2466052,2431774]]    
col = ['2015','2010']
ind = ['서울','부산','인천','대구']
df3 = pd.DataFrame(data, index = ind, columns = col)
df3

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [476]:
print(df.values) #데이터 프레임 값 확인
print(df. index) #데이터 프레임 인덱스 확인
print(df. columns) #데이터 프레임 컬럼 확인

[[9904312 9631482]
 [3448737 3393191]
 [2890451 2632035]
 [2466052 2431774]]
Index(['서울', '부산', '인천', '대구'], dtype='object')
Index(['2015', '2010'], dtype='object')

In [477]:
df['2005'] = [9762546, 3512547, 2517680, 2456016]

In [478]:
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

### 연습문제

In [479]:
df1 = {'홍길동':[175.3, 66.2, 27.0], '김사또':[180.2, 78.9, 49.0], '임꺽정':[178.6, 55.1, 35.0]}
df1=pd.DataFrame(df1, index = ['키', '몸무게', '나이'])

In [480]:
df2 = df1.T  #df2변수에 초기화해줌

In [481]:
df1

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

In [482]:
df2

         키   몸무게    나이
홍길동  175.3  66.2  27.0
김사또  180.2  78.9  49.0
임꺽정  178.6  55.1  35.0

### pandas 연산

In [483]:
population /1000000   #모든 배열에 연산이 된다.

        2015      2010
서울  9.904312  9.631482
부산  3.448737  3.393191
인천  2.890451  2.632035
대구  2.466052  2.431774

In [484]:
population = pd.Series([9904312, 3448737, 2890451, 2466052], index=['서울','부산','인천','대구'])

In [485]:
data = {'서울': 9631482, '부산': 3393191, '인천': 2632035, '대구': 1490158}
population2 = pd. Series(data)

In [486]:
population2

서울    9631482
부산    3393191
인천    2632035
대구    1490158
dtype: int64

In [487]:
ds = population - population2
ds

서울    272830
부산     55546
인천    258416
대구    975894
dtype: int64

In [488]:
rs = (population - population2)/population2*100
rs[rs.notnull()]

서울     2.832690
부산     1.636984
인천     9.818107
대구    65.489297
dtype: float64

### pandas 데이터 접근을 위한 인덱싱, 슬라이싱

In [489]:
student1 = pd.Series ({'java': 95, 'python': 100, 'ml':85, 'html/css': 70})

In [490]:
student1

java         95
python      100
ml           85
html/css     70
dtype: int64

In [491]:
student1[0]  #위치값으로 인덱싱 가능하고
student1['java']  #이름으로도 인덱싱 가능하다.

95

In [492]:
student1[3], student1['html/css']

(70, 70)

In [493]:
student1[[1,3,2]]  #한꺼번에 데이터에 진입

python      100
html/css     70
ml           85
dtype: int64

In [494]:
student1[['python', 'html/css','ml']]

python      100
html/css     70
ml           85
dtype: int64

### Series Boolean 인덱싱 : 위치를 몰라요, 85이상인 값에 접근하고 싶어

In [495]:
student1 >=85

java         True
python       True
ml           True
html/css    False
dtype: bool

In [496]:
student1[student1>=85]   # 시리즈에 다시 연결

java       95
python    100
ml         85
dtype: int64

In [497]:
# 성적이 90 이상인 과목
student1[student1>=90]

java       95
python    100
dtype: int64

In [498]:
# 성적이 90 미만인 과목
student1[student1<90]

ml          85
html/css    70
dtype: int64

In [499]:
#성적이 75이상 90미만인 과목
student1[(student1 >=75)&(student1<90)]

ml    85
dtype: int64

### Series 슬라이싱

In [500]:
student1

java         95
python      100
ml           85
html/css     70
dtype: int64

In [501]:
student1[0:2]

java       95
python    100
dtype: int64

In [502]:
student1[:2]

java       95
python    100
dtype: int64

In [503]:
student1['java':'html/css']  #이름으로 하면 언급한 범위 둘다 포함됨

java         95
python      100
ml           85
html/css     70
dtype: int64

In [504]:
df_stu = pd.DataFrame({'java':[95,85], 'python':[100,95], 'ml':[85,85],'html/css':[70,75]}, index = ['dk', 'sw'])

In [505]:
df_stu

    java  python  ml  html/css
dk    95     100  85        70
sw    85      95  85        75

In [506]:
df_stu[['python', 'ml']]

    python  ml
dk     100  85
sw      95  85

In [507]:
df_stu[0:1]

    java  python  ml  html/css
dk    95     100  85        70

In [508]:
df_stu['dk':'sw']

    java  python  ml  html/css
dk    95     100  85        70
sw    85      95  85        75

### loc와 iloc 인덱싱 : 데이터 접근을 위한 방식
- df.loc['행'] / df.iloc['행']
- df.loc['행', '컬럼'] / df.iloc['행', '컬럼']

- loc: 인덱스와 컬럼에 존재하는 문자열을 기준으로
- iloc: 인덱스와 컬럼에 초기에 배정되는 인덱스 번호를 기준으로

In [509]:
df_stu.loc['dk'] # loc :실제 인덱스를 사용하여 행을 가지고 올 때 사용 -> 문자열 값이 들어감

java         95
python      100
ml           85
html/css     70
Name: dk, dtype: int64

In [510]:
df_stu.iloc[0,2]  # iloc: 좌표 숫자로 불러옴

85

### 데이터 불러오기

In [511]:
population_number = pd. read_csv('data/population_number.csv',index_col = '도시', encoding = 'euc_kr')

In [512]:
population_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [513]:
# 데이터 크기 확인
population_number.shape

(4, 5)

### 연습문제

In [514]:
population_number.loc['인천':'대구',['2010','2015']]

         2010     2015
도시
인천  2632035.0  2890451
대구  2431774.0  2466052

In [515]:
population_number.loc[['인천','대구'],['2010','2015']]           #다른방법

         2010     2015
도시
인천  2632035.0  2890451
대구  2431774.0  2466052

In [516]:
df_stu[df_stu['python']==100]

    java  python  ml  html/css
dk    95     100  85        70

In [517]:
df_stu

    java  python  ml  html/css
dk    95     100  85        70
sw    85      95  85        75

In [518]:
# html/css 점수가 75점 이상인 데이터의 행은 모두 출력: 불리언 인덱싱
se=df_stu[df_stu['html/css']>=75]
df_stu.loc[df_stu['html/css']>=75,'ml']

sw    85
Name: ml, dtype: int64

In [519]:
se[['java']]

    java
sw    85

In [520]:
population_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [521]:
population_number[population_number['2000']>=3000000]['2000']

도시
서울    9853972
부산    3655437
Name: 2000, dtype: int64

### pandas 유용한 함수

In [522]:
population_number['2015'].value_counts()  #값이 숫자, 문자열, 카테고리 값인 경우에 각각의 값이 나온 횟수를 셀 때 사용

2466052    1
2890451    1
3448737    1
9904312    1
Name: 2015, dtype: int64

In [523]:
population_number['2010'].value_counts()

9631482.0    1
2431774.0    1
2632035.0    1
Name: 2010, dtype: int64

In [524]:
# 정렬
# ascending = false 내림차순 정렬, true -> 디폴트값

In [525]:
population_number.sort_index()

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338

In [526]:
population_number['2010'].sort_values(ascending =False)

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64

In [527]:
population_number.sort_values(by='2000')

     지역     2015       2010       2005     2000
도시
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
서울  수도권  9904312  9631482.0  9762546.0  9853972

In [528]:
population_number.sort_values(by = ['지역', '2010'])  #데이터 프레임을 지역, 2010년 인구수 기준으로 정렬

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

In [529]:
population_number = population_number.drop('인천')  #삭제 drop

In [530]:
population_number.drop('서울', inplace = True)

In [531]:
population_number

     지역     2015       2010       2005     2000
도시
부산  경상권  3448737        NaN        NaN  3655437
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [532]:
population_number.drop('2000',axis =1, inplace = True)  # axis는 행이 1 열이 0 방향

In [533]:
population_number

     지역     2015       2010       2005
도시
부산  경상권  3448737        NaN        NaN
대구  경상권  2466052  2431774.0  2456016.0

### score.csv 파일 불러오기

In [534]:
score = pd.read_csv('data/score.csv',index_col = '과목',encoding = 'euc_kr')

In [535]:
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

- axis = 0 행 방향
- axis = 1 열 방향으로 연산하게 됨

In [536]:
score.sum()  #학급별 총계

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [537]:
# 각 과목의 총합점수를 정렬된 형태로 보고 싶어요.
# sort_values
# ascending = false 정렬해주세요 ~
score.sum(axis =1).sort_values(ascending=False)

과목
사회    298
영어    282
국어    253
수학    201
과학    163
dtype: int64

In [538]:
score['총합'] = score.sum(axis=1)  # 총합항목 추가

In [539]:
score

    1반  2반  3반  4반   총합
과목
수학  45  44  73  39  201
영어  76  92  45  69  282
국어  47  92  45  69  253
사회  92  81  85  40  298
과학  11  79  47  26  163

In [540]:
score['평균'] = score.loc[:,'1반':"4반"].mean(axis =1)   # 평균항목 추가

In [541]:
score

    1반  2반  3반  4반   총합     평균
과목
수학  45  44  73  39  201  50.25
영어  76  92  45  69  282  70.50
국어  47  92  45  69  253  63.25
사회  92  81  85  40  298  74.50
과학  11  79  47  26  163  40.75

In [542]:
score.info() # info() 데이터의 정보를 확인하는 키워드

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 수학 to 과학
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1반      5 non-null      int64
 1   2반      5 non-null      int64
 2   3반      5 non-null      int64
 3   4반      5 non-null      int64
 4   총합      5 non-null      int64
 5   평균      5 non-null      float64
dtypes: float64(1), int64(5)
memory usage: 280.0+ bytes

In [ ]:
score.loc['반평균'] = score.mean(axis=0)

In [ ]:
score

### 가장 큰 값 구하기 max()

In [ ]:
score.max()

In [ ]:
score.max(axis =1)

### 가장 작은 값 구하기 min()

In [ ]:
score.min()

In [ ]:
score.min(axis=1)

### 연습문제

In [ ]:
maxArr = score.loc[:'과학',:'4반'].max(axis=1)
maxArr

In [ ]:
minArr = score.loc[:'과학',:'4반'].min(axis=1)
minArr

In [ ]:
maxArr - minArr

In [ ]:
score.drop('수학', axis =0)

In [ ]:
score

### apply 함수

In [ ]:
def max_min(x):
    return x.max() - x.min()

In [ ]:
score.loc[:'과학',:'4반'].apply (max_min,axis =1)

### cut 함수

In [ ]:
ages = [0,2,10,21,23,37,31,61,20,41,32,100]
binss = [0,15,30,40,60,99]
labelss = ['미성년자', '청년', '장년', '중년', '노년']
cats = pd.cut(ages, binss, labels = labelss)

In [ ]:
cats

In [ ]:
type(cats)

In [ ]:
ageArr = pd. DataFrame(ages, columns = ['ages'])

In [ ]:
ageArr

In [ ]:
ageArr['cats'] = cats
ageArr

In [ ]:
ageArr = ageArr.dropna()   # null값이 있는 행에 대해서 그 행을 전부 삭제하는 함수

In [ ]:
ageArr

In [ ]:
ageArr['cats'].value_counts()

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [ ]:
df1

In [ ]:
df2

In [ ]:
df3

In [ ]:
print(df1.shape)
print(df2.shape)
print(df3.shape)

In [ ]:
result=pd.concat([df1,df2,df3],  keys = ['x','y','z'])    #디폴트 값은 axis =0 행 방향
print(result)

In [ ]:
result. index

In [ ]:
result. index.get_level_values(1)

In [546]:
result.head(10) #위에서 5개만 보겠다 5개가 디폴트값

      A   B   C   D
x 0  A0  B0  C0  D0
  1  A1  B1  C1  D1
  2  A2  B2  C2  D2
  3  A3  B3  C3  D3
y 4  A4  B4  C4  D4
  5  A5  B5  C5  D5
  6  A6  B6  C6  D6
  7  A7  B7  C7  D7
z 8  A8  B8  C8  D8
  9  A9  B9  C9  D9

In [548]:
result.tail(7) #아래서부터 5개 보겠다. 5개가 디폴트값

        A    B    C    D
y 5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [544]:
# 다중 인덱스 접근
result.loc[[('x',0),('y',4)],'D']

x  0    D0
y  4    D4
Name: D, dtype: object

### 연습문제

In [569]:
survived = pd.Series([1,0,1,0,1])
survived.name = 'Survived'
PassengerID = pd.Series([1,1,2,0,1])
PassengerID.name = 'PassengerID'
Sex =pd.Series(['female', 'female','male','male', 'female'])
Sex.name = 'Sex'
ti= pd.concat([survived, PassengerID, Sex] , axis =1)

In [556]:
# con.columns =['Survied','PassengerID', 'Sex']

In [570]:
ti

   Survived  PassengerID     Sex
0         1            1  female
1         0            1  female
2         1            2    male
3         0            0    male
4         1            1  female

### groupby 함수

In [571]:
ti. groupby(['Sex', 'Survived']).count()

                 PassengerID
Sex    Survived
female 0                   1
       1                   2
male   0                   1
       1                   1

In [575]:
ti[['Sex','Survived']].groupby('Sex').sum()

        Survived
Sex
female         2
male           1